## Importing packages and explore the dataset

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import psycopg2

In [2]:
df = pd.read_csv('Apple_Store_Sales_Data.csv')

In [3]:
df.head()

,customer_name,email_address,phone_numbers,purchase_date_time,store_location,sales_person,avg_sales_person_rating,sales_person_rating,purchased_items,purchased_quantities,product_prices,discounts
0,Claudelle Tichelaar,ctichelaar1r@nifty.com,3879800199|3879804436,1/2/2019 0:39,"45 Grand Central Terminal New York, NY 10017",Gail Jones,4.5,4.0,{iMac 21.5-inch C},{1},{1499},{0}
1,Don Ezzy,dezzy18@etsy.com,4877147978|4877149656,1/2/2019 13:26,"185 Greenwich Street New York, NY 10007",Ron Stone,4.1,1.0,"{iMac Pro,Mac Pro A}","{1,1}","{4999,2999}","{0.2,0.1}"
2,Levy Vickress,lvickress1b@yolasite.com,2746684098|2746682450,1/2/2019 17:09,"767 Fifth Avenue New York, NY 10153",Day Yi,5.0,5.0,"{MacBook Pro 13-inch A,MacBook Pro 15-inch D}","{1,1}","{1299,1999}","{0,0}"
3,Ertha Lowthorpe,elowthorpe1o@google.ru,3227613718|3227618832,1/2/2019 18:44,"767 Fifth Avenue New York, NY 10153",Liz Goldsmith,3.6,NaN,"{MacBook 12-inch A,MacBook Pro 13-inch A,iMac ...","{1,1,1}","{1299,1299,1299}","{0,0,0}"
4,Jacquenetta Tease,jtease1n@biblegateway.com,4344482346|4344485585,1/2/2019 20:49,"185 Greenwich Street New York, NY 10007",Jimmy Chang,3.9,2.0,"{iMac 21.5-inch A,iMac 27-inch B,iMac 27-inch C}","{1,1,1}","{1099,1999,2299}","{0,0,0}"

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 12 columns):
customer_name              50 non-null object
email_address              50 non-null object
phone_numbers              50 non-null object
purchase_date_time         50 non-null object
store_location             50 non-null object
sales_person               50 non-null object
avg_sales_person_rating    50 non-null float64
sales_person_rating        44 non-null float64
purchased_items            50 non-null object
purchased_quantities       50 non-null object
product_prices             50 non-null object
discounts                  50 non-null object
dtypes: float64(2), object(10)
memory usage: 4.8+ KB

In [5]:
#check if there is duplicated values within the dataframe
for i in range(df.shape[1]):
    if df.iloc[i].duplicated().count() != 0:
        print('There is duplicated value in ', df.columns[i])
    else:
        print('There is no duplicated value in ', df.columns[i])

There is duplicated value in  customer_name
There is duplicated value in  email_address
There is duplicated value in  phone_numbers
There is duplicated value in  purchase_date_time
There is duplicated value in  store_location
There is duplicated value in  sales_person
There is duplicated value in  avg_sales_person_rating
There is duplicated value in  sales_person_rating
There is duplicated value in  purchased_items
There is duplicated value in  purchased_quantities
There is duplicated value in  product_prices
There is duplicated value in  discounts

In [6]:
df[['customer_name','purchase_date_time']][df.customer_name.isin(['Goran Bunyan','Jacquenetta Tease'])]
#there are orders made by same person at different time

        customer_name purchase_date_time
4   Jacquenetta Tease     1/2/2019 20:49
21       Goran Bunyan     1/4/2019 15:08
23       Goran Bunyan     1/4/2019 19:45
24  Jacquenetta Tease     1/4/2019 20:18

## Create database tables
Before running the commands below,I have created a apple_store database in psql.

In [7]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:0925@localhost/apple_store'

In [8]:
# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

In [9]:
# Establish a connection
connection = engine.connect()

In [10]:
# Pass the SQL statements that create all tables
stmt = """
    CREATE TABLE phones(
        phone_id int NOT NULL,
        phone_number char(10),
        PRIMARY KEY (phone_id)
        );
        
    CREATE TABLE customers(
        customer_id int NOT NULL,
        customer_name varchar(50),
        email_address varchar(50),
        PRIMARY KEY (customer_id)
        );
    
    CREATE TABLE cust_phones(
        customer_id int NOT NULL,
        phone_id int NOT NULL,
        PRIMARY KEY (customer_id, phone_id),
        FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
        FOREIGN KEY (phone_id) REFERENCES phones(phone_id)
    );
    
    CREATE TABLE products(
        product_id int NOT NULL,
        product_name varchar(30),
        product_price numeric(4,0),
        PRIMARY KEY (product_id)
    );
    
    CREATE TABLE salespeople(
        sp_id int NOT NULL,
        sales_person varchar(50) NOT NULL,
        avg_sales_person_rating numeric(2,1),
        PRIMARY KEY (sp_id)
        );
        
    CREATE TABLE sales(
        sales_id int NOT NULL,
        customer_id int NOT NULL,
        purchase_date_time timestamp,
        store_location varchar(50),
        sp_id int,
        sales_person_rating numeric(2,1),
        PRIMARY KEY (sales_id),
        FOREIGN KEY (customer_id) REFERENCES customers(customer_id),
        FOREIGN KEY (sp_id) REFERENCES salespeople(sp_id)
        );
        
        
    CREATE TABLE sold_items(
        si_id int NOT NULL,
        sales_id int NOT NULL,
        product_id int NOT NULL,
        purchased_quantities int,
        discounts decimal(3,2),
        PRIMARY KEY (si_id),
        FOREIGN KEY (sales_id) REFERENCES sales(sales_id),
        FOREIGN KEY (product_id) REFERENCES products(product_id)
    );
"""

In [11]:
# Execute the statement to create tables
connection.execute(stmt)

## Extract, Transform and Load (ETL) 
Now extract, transform and load (ETL) the dataset into the database. In order to do so we will have to perform several data transformations on the loaded dataframe.

In [12]:
#since there are duplicated customer_name, first I need to drop them, then create customer_id for each unique customer
temp_customer_df = pd.DataFrame(df.customer_name.unique(), columns=['customer_name'])
temp_customer_df.insert(0, 'customer_id', range(1, 1 + len(temp_customer_df)))

In [13]:
temp_customer_df.head()

   customer_id        customer_name
0            1  Claudelle Tichelaar
1            2             Don Ezzy
2            3        Levy Vickress
3            4      Ertha Lowthorpe
4            5    Jacquenetta Tease

Now create a list to map customer_id with each customer_name and then insert this list to df as a new column

In [14]:
# Map customer_id
customer_id_list = [temp_customer_df.customer_id[temp_customer_df.customer_name == i].\
                    values[0] for i in df.customer_name]

# Add customer_id to the main dataframe
df.insert(1, 'customer_id', customer_id_list)

In [15]:
df.head()

,customer_name,customer_id,email_address,phone_numbers,purchase_date_time,store_location,sales_person,avg_sales_person_rating,sales_person_rating,purchased_items,purchased_quantities,product_prices,discounts
0,Claudelle Tichelaar,1,ctichelaar1r@nifty.com,3879800199|3879804436,1/2/2019 0:39,"45 Grand Central Terminal New York, NY 10017",Gail Jones,4.5,4.0,{iMac 21.5-inch C},{1},{1499},{0}
1,Don Ezzy,2,dezzy18@etsy.com,4877147978|4877149656,1/2/2019 13:26,"185 Greenwich Street New York, NY 10007",Ron Stone,4.1,1.0,"{iMac Pro,Mac Pro A}","{1,1}","{4999,2999}","{0.2,0.1}"
2,Levy Vickress,3,lvickress1b@yolasite.com,2746684098|2746682450,1/2/2019 17:09,"767 Fifth Avenue New York, NY 10153",Day Yi,5.0,5.0,"{MacBook Pro 13-inch A,MacBook Pro 15-inch D}","{1,1}","{1299,1999}","{0,0}"
3,Ertha Lowthorpe,4,elowthorpe1o@google.ru,3227613718|3227618832,1/2/2019 18:44,"767 Fifth Avenue New York, NY 10153",Liz Goldsmith,3.6,NaN,"{MacBook 12-inch A,MacBook Pro 13-inch A,iMac ...","{1,1,1}","{1299,1299,1299}","{0,0,0}"
4,Jacquenetta Tease,5,jtease1n@biblegateway.com,4344482346|4344485585,1/2/2019 20:49,"185 Greenwich Street New York, NY 10007",Jimmy Chang,3.9,2.0,"{iMac 21.5-inch A,iMac 27-inch B,iMac 27-inch C}","{1,1,1}","{1099,1999,2299}","{0,0,0}"

In [16]:
# repeat the same steps for sales_person, and create sales_id
temp_sp_df = pd.DataFrame(df.sales_person.unique(), columns=['sales_person'])
temp_sp_df.insert(0, 'sp_id', range(1, 1 + len(temp_sp_df)))

In [17]:
temp_sp_df.head()

   sp_id   sales_person
0      1     Gail Jones
1      2      Ron Stone
2      3         Day Yi
3      4  Liz Goldsmith
4      5    Jimmy Chang

Next, work with variables that have multiple in the same entry, including phone_numbers, purchased_items, purchased_quantities, product_prices and discounts.

In [18]:
# Split phone numbers and expand row-wise. Store in a temporary dataframe
temp_phone_numbers_df = df.phone_numbers.str.split('|').apply(pd.Series, 1).stack()

# Drop index level to match main dataframe
temp_phone_numbers_df.index = temp_phone_numbers_df.index.droplevel(-1)

# Name of new column
temp_phone_numbers_df.name = 'phone_number'

#create dataframe with customer id and phone numbers columns
df0 = df[['customer_id','phone_numbers']]

# Delete the original phone_numbers columns, no longer necessary
del df0['phone_numbers']

# Join the original dataframe with the temporary phone numbers
df0 = df0.join(temp_phone_numbers_df)

In [19]:
#create phone_id for each unique phone_numbers
temp_phone_numbers_df1 = pd.DataFrame(df0.phone_number.unique(), columns=['phone_number'])
temp_phone_numbers_df1.insert(0, 'phone_id', range(1, 1 + len(temp_phone_numbers_df1)))
temp_phone_numbers_df1.head()

   phone_id phone_number
0         1   3879800199
1         2   3879804436
2         3   4877147978
3         4   4877149656
4         5   2746684098

In [20]:
# Map phone_id
phone_id_list = [temp_phone_numbers_df1.phone_id[temp_phone_numbers_df1.phone_number == i].values[0] for i in df0.phone_number]

# Add customer_id to the main dataframe
df0.insert(0, 'phone_id', phone_id_list)

In [21]:
df0.head()

   phone_id  customer_id phone_number
0         1            1   3879800199
0         2            1   3879804436
1         3            2   4877147978
1         4            2   4877149656
2         5            3   2746684098

1 . Now populating values of the customers and phones table into database

In [22]:
#now take a look at the values that will be pushing into customer_name table
df[['customer_id', 'customer_name','email_address']].drop_duplicates().head()

   customer_id        customer_name              email_address
0            1  Claudelle Tichelaar     ctichelaar1r@nifty.com
1            2             Don Ezzy           dezzy18@etsy.com
2            3        Levy Vickress   lvickress1b@yolasite.com
3            4      Ertha Lowthorpe     elowthorpe1o@google.ru
4            5    Jacquenetta Tease  jtease1n@biblegateway.com

In [23]:
#remove duplicates and push into database
df[['customer_id', 'customer_name','email_address']]. \
    drop_duplicates().to_sql(name='customers', con=engine, if_exists='append', index=False)

In [24]:
#now pushing phones info to the database
temp_phone_numbers_df1.to_sql(name='phones', con=engine, if_exists='append', index=False)

2. Now populating values of cust_phones into database

In [25]:
#pushing customer_info into database
df0[['customer_id','phone_id']].\
    drop_duplicates().to_sql(name='cust_phones',con=engine, if_exists='append', index=False)

3. Now populating the values of salespeople into database

In [27]:
df_sp_new = df[['sales_person','avg_sales_person_rating']]

In [28]:
# Map sales_id
sp_id_list = [temp_sp_df.sp_id[temp_sp_df.sales_person == i].values[0] for i in df_sp_new.sales_person]
#insert into data frame
df_sp_new.insert(0, 'sp_id', sp_id_list)

In [29]:
df_sp_new.head(20)
#we can see here a sales could have two different rating, which means sales_id can't be the only pk

    sp_id   sales_person  avg_sales_person_rating
0       1     Gail Jones                      4.5
1       2      Ron Stone                      4.1
2       3         Day Yi                      5.0
3       4  Liz Goldsmith                      3.6
4       5    Jimmy Chang                      3.9
5       6  Allen Johnson                      4.3
6       1     Gail Jones                      4.5
7       7       JJ Chase                      4.8
8       8    Jane Argyle                      4.0
9       8    Jane Argyle                      4.0
10      9    Mary Malone                      4.1
11     10  George Foster                      4.2
12      4  Liz Goldsmith                      3.6
13     11    Hilary Zane                      4.5
14      9    Mary Malone                      4.1
15      5    Jimmy Chang                      3.9
16     12   Mike Darling                      4.4
17     11    Hilary Zane                      4.5
18     13     Mike Smith                      3.8
19      4  Liz Goldsmith                      3.6

In [30]:
#pushing into database
df_sp_new[['sp_id','sales_person','avg_sales_person_rating']].\
    drop_duplicates().to_sql(name = 'salespeople', con = engine, if_exists='append', index=False)

4. Now populating the values of products table into database

In [31]:
temp_purchased_items_df = df.purchased_items.str.split(',').apply(pd.Series, 1).stack().str.strip('{}')
temp_purchased_items_df.index = temp_purchased_items_df.index.droplevel(-1)
temp_purchased_items_df.name = 'product_name'
df1 = df[['customer_id', 'purchased_items']]
del df1['purchased_items']
df1 = df1.join(temp_purchased_items_df)
df1.head()

   customer_id           product_name
0            1       iMac 21.5-inch C
1            2               iMac Pro
1            2              Mac Pro A
2            3  MacBook Pro 13-inch A
2            3  MacBook Pro 15-inch D

In [32]:
#create product_id for each unique purchased item
temp_purchased_items_df1 = pd.DataFrame(df1.product_name.unique(), columns=['product_name'])
temp_purchased_items_df1.insert(0, 'product_id', range(1, 1 + len(temp_purchased_items_df1)))
temp_purchased_items_df1.head()

   product_id           product_name
0           1       iMac 21.5-inch C
1           2               iMac Pro
2           3              Mac Pro A
3           4  MacBook Pro 13-inch A
4           5  MacBook Pro 15-inch D

In [35]:
#split product_prices
temp_product_prices_df = df.product_prices.str.split(',').apply(pd.Series, 1).stack().str.strip('{}')
temp_product_prices_df.index = temp_product_prices_df.index.droplevel(-1)
temp_product_prices_df.name = 'product_price'
df2 = df[['customer_id','product_prices']]
del df2['product_prices']
df2 = df2.join(temp_product_prices_df)
df2.head()

   customer_id product_price
0            1          1499
1            2          4999
1            2          2999
2            3          1299
2            3          1999

In [36]:
df4 = pd.concat([df1, df2], axis=1, sort=False)
df4.head()

   customer_id           product_name  customer_id product_price
0            1       iMac 21.5-inch C            1          1499
1            2               iMac Pro            2          4999
1            2              Mac Pro A            2          2999
2            3  MacBook Pro 13-inch A            3          1299
2            3  MacBook Pro 15-inch D            3          1999

In [37]:
product_id_list = [temp_purchased_items_df1.product_id[temp_purchased_items_df1.product_name == i].values[0] for i in df4.product_name]
df4.insert(0, 'product_id', product_id_list)
df4.head()

   product_id  customer_id           product_name  customer_id product_price
0           1            1       iMac 21.5-inch C            1          1499
1           2            2               iMac Pro            2          4999
1           3            2              Mac Pro A            2          2999
2           4            3  MacBook Pro 13-inch A            3          1299
2           5            3  MacBook Pro 15-inch D            3          1999

In [38]:
#pushing the product data into database
df4[['product_id','product_name','product_price']].\
    drop_duplicates().to_sql(name = 'products', con=engine, if_exists='append', index=False)

5. Now populating values of sales table into database

In [39]:
df5 = df[['customer_id','purchase_date_time','store_location','sales_person_rating','sales_person']]
df5.head()

,customer_id,purchase_date_time,store_location,sales_person_rating,sales_person
0,1,1/2/2019 0:39,"45 Grand Central Terminal New York, NY 10017",4.0,Gail Jones
1,2,1/2/2019 13:26,"185 Greenwich Street New York, NY 10007",1.0,Ron Stone
2,3,1/2/2019 17:09,"767 Fifth Avenue New York, NY 10153",5.0,Day Yi
3,4,1/2/2019 18:44,"767 Fifth Avenue New York, NY 10153",NaN,Liz Goldsmith
4,5,1/2/2019 20:49,"185 Greenwich Street New York, NY 10007",2.0,Jimmy Chang

In [40]:
# Map sp_id
sp_id_list2 = [temp_sp_df.sp_id[temp_sp_df.sales_person == i].values[0] for i in df5.sales_person]
#insert into data frame
df5.insert(0, 'sp_id', sp_id_list2)
df5.head()

,sp_id,customer_id,purchase_date_time,store_location,sales_person_rating,sales_person
0,1,1,1/2/2019 0:39,"45 Grand Central Terminal New York, NY 10017",4.0,Gail Jones
1,2,2,1/2/2019 13:26,"185 Greenwich Street New York, NY 10007",1.0,Ron Stone
2,3,3,1/2/2019 17:09,"767 Fifth Avenue New York, NY 10153",5.0,Day Yi
3,4,4,1/2/2019 18:44,"767 Fifth Avenue New York, NY 10153",NaN,Liz Goldsmith
4,5,5,1/2/2019 20:49,"185 Greenwich Street New York, NY 10007",2.0,Jimmy Chang

In [41]:
#create sales_id for each unique sales
temp_sales_df = pd.DataFrame(df5.purchase_date_time.unique(), columns=['purchase_date_time'])
temp_sales_df.insert(0, 'sales_id', range(1, 1 + len(temp_sales_df)))
temp_sales_df.head()

   sales_id purchase_date_time
0         1      1/2/2019 0:39
1         2     1/2/2019 13:26
2         3     1/2/2019 17:09
3         4     1/2/2019 18:44
4         5     1/2/2019 20:49

In [42]:
# Map sales_id
df6 = pd.merge(df5,temp_sales_df, on= 'purchase_date_time', how='inner' )
df6.head()

,sp_id,customer_id,purchase_date_time,store_location,sales_person_rating,sales_person,sales_id
0,1,1,1/2/2019 0:39,"45 Grand Central Terminal New York, NY 10017",4.0,Gail Jones,1
1,2,2,1/2/2019 13:26,"185 Greenwich Street New York, NY 10007",1.0,Ron Stone,2
2,3,3,1/2/2019 17:09,"767 Fifth Avenue New York, NY 10153",5.0,Day Yi,3
3,4,4,1/2/2019 18:44,"767 Fifth Avenue New York, NY 10153",NaN,Liz Goldsmith,4
4,5,5,1/2/2019 20:49,"185 Greenwich Street New York, NY 10007",2.0,Jimmy Chang,5

In [43]:
#pushing data into database
df6[['sales_id','customer_id','purchase_date_time','store_location','sp_id','sales_person_rating']].\
    drop_duplicates().to_sql(name='sales', con=engine, if_exists='append', index=False)

6. Now populating values for sold_items tables into database

In [44]:
#split purchased_quantities
temp_purchased_quantities_df = df.purchased_quantities.str.split(',').apply(pd.Series, 1).stack().str.strip('{}')
temp_purchased_quantities_df.index = temp_purchased_quantities_df.index.droplevel(-1)
temp_purchased_quantities_df.name = 'purchased_quantities'
df7 = df[['customer_id','purchased_quantities']]
del df7['purchased_quantities']
df7 = df7.join(temp_purchased_quantities_df)
df7.head()

   customer_id purchased_quantities
0            1                    1
1            2                    1
1            2                    1
2            3                    1
2            3                    1

In [45]:
#split discounts
temp_discounts_df = df.discounts.str.split(',').apply(pd.Series, 1).stack().str.strip('{}')
temp_discounts_df.index = temp_discounts_df.index.droplevel(-1)
temp_discounts_df.name = 'discounts'
df8 = df[['customer_id','discounts','purchase_date_time']]
del df8['discounts']
df8 = df8.join(temp_discounts_df)
df8.head()

   customer_id purchase_date_time discounts
0            1      1/2/2019 0:39         0
1            2     1/2/2019 13:26       0.2
1            2     1/2/2019 13:26       0.1
2            3     1/2/2019 17:09         0
2            3     1/2/2019 17:09         0

In [46]:
temp_si_df = pd.concat([df7, df8], axis=1, sort=False)
temp_si_df.head()

   customer_id purchased_quantities  customer_id purchase_date_time discounts
0            1                    1            1      1/2/2019 0:39         0
1            2                    1            2     1/2/2019 13:26       0.2
1            2                    1            2     1/2/2019 13:26       0.1
2            3                    1            3     1/2/2019 17:09         0
2            3                    1            3     1/2/2019 17:09         0

In [47]:
#map sales_id
df9 = pd.merge(temp_si_df,temp_sales_df, on= 'purchase_date_time', how='inner' )
df9.head()

,customer_id,purchased_quantities,customer_id,purchase_date_time,discounts,sales_id
0,1,1,1,1/2/2019 0:39,0,1
1,2,1,2,1/2/2019 13:26,0.2,2
2,2,1,2,1/2/2019 13:26,0.1,2
3,3,1,3,1/2/2019 17:09,0,3
4,3,1,3,1/2/2019 17:09,0,3

In [48]:
df1.head()

   customer_id           product_name
0            1       iMac 21.5-inch C
1            2               iMac Pro
1            2              Mac Pro A
2            3  MacBook Pro 13-inch A
2            3  MacBook Pro 15-inch D

In [49]:
df1.reset_index(drop=True, inplace=True)
df9.reset_index(drop=True, inplace=True)
df10 = pd.concat([df1, df9], axis=1, sort=False)
df10.head()

,customer_id,product_name,customer_id,purchased_quantities,customer_id,purchase_date_time,discounts,sales_id
0,1,iMac 21.5-inch C,1,1,1,1/2/2019 0:39,0,1
1,2,iMac Pro,2,1,2,1/2/2019 13:26,0.2,2
2,2,Mac Pro A,2,1,2,1/2/2019 13:26,0.1,2
3,3,MacBook Pro 13-inch A,3,1,3,1/2/2019 17:09,0,3
4,3,MacBook Pro 15-inch D,3,1,3,1/2/2019 17:09,0,3

In [50]:
product_id_list2 = [temp_purchased_items_df1.product_id[temp_purchased_items_df1.\
                                                        product_name == i].values[0] for i in df10.product_name]
df10.insert(0, 'product_id', product_id_list)
df10.head()

,product_id,customer_id,product_name,customer_id,purchased_quantities,customer_id,purchase_date_time,discounts,sales_id
0,1,1,iMac 21.5-inch C,1,1,1,1/2/2019 0:39,0,1
1,2,2,iMac Pro,2,1,2,1/2/2019 13:26,0.2,2
2,3,2,Mac Pro A,2,1,2,1/2/2019 13:26,0.1,2
3,4,3,MacBook Pro 13-inch A,3,1,3,1/2/2019 17:09,0,3
4,5,3,MacBook Pro 15-inch D,3,1,3,1/2/2019 17:09,0,3

In [51]:
df10[['sales_id','product_id','purchased_quantities','discounts']].drop_duplicates().head()

   sales_id  product_id purchased_quantities discounts
0         1           1                    1         0
1         2           2                    1       0.2
2         2           3                    1       0.1
3         3           4                    1         0
4         3           5                    1         0

In [52]:
def make_identifier(df):
    str_id = df.apply(lambda x: '_'.join(map(str, x)), axis=1)
    return pd.factorize(str_id)[0]

df10['si_id'] = make_identifier(df10[['sales_id','product_id','discounts','purchased_quantities']])

In [53]:
df10.head()

,product_id,customer_id,product_name,customer_id,purchased_quantities,customer_id,purchase_date_time,discounts,sales_id,si_id
0,1,1,iMac 21.5-inch C,1,1,1,1/2/2019 0:39,0,1,0
1,2,2,iMac Pro,2,1,2,1/2/2019 13:26,0.2,2,1
2,3,2,Mac Pro A,2,1,2,1/2/2019 13:26,0.1,2,2
3,4,3,MacBook Pro 13-inch A,3,1,3,1/2/2019 17:09,0,3,3
4,5,3,MacBook Pro 15-inch D,3,1,3,1/2/2019 17:09,0,3,4

In [54]:
df10[['si_id','sales_id','product_id','purchased_quantities','discounts']].\
    drop_duplicates().to_sql(name='sold_items', con=engine, if_exists='append', index=False)

## Spot Checks & Validation
Let's run some tests to check data was trasnfered properly and all relations have been upheld.

In [56]:
df_test = pd.read_csv('Apple_Store_Sales_Data.csv')
df_test.head()

,customer_name,email_address,phone_numbers,purchase_date_time,store_location,sales_person,avg_sales_person_rating,sales_person_rating,purchased_items,purchased_quantities,product_prices,discounts
0,Claudelle Tichelaar,ctichelaar1r@nifty.com,3879800199|3879804436,1/2/2019 0:39,"45 Grand Central Terminal New York, NY 10017",Gail Jones,4.5,4.0,{iMac 21.5-inch C},{1},{1499},{0}
1,Don Ezzy,dezzy18@etsy.com,4877147978|4877149656,1/2/2019 13:26,"185 Greenwich Street New York, NY 10007",Ron Stone,4.1,1.0,"{iMac Pro,Mac Pro A}","{1,1}","{4999,2999}","{0.2,0.1}"
2,Levy Vickress,lvickress1b@yolasite.com,2746684098|2746682450,1/2/2019 17:09,"767 Fifth Avenue New York, NY 10153",Day Yi,5.0,5.0,"{MacBook Pro 13-inch A,MacBook Pro 15-inch D}","{1,1}","{1299,1999}","{0,0}"
3,Ertha Lowthorpe,elowthorpe1o@google.ru,3227613718|3227618832,1/2/2019 18:44,"767 Fifth Avenue New York, NY 10153",Liz Goldsmith,3.6,NaN,"{MacBook 12-inch A,MacBook Pro 13-inch A,iMac ...","{1,1,1}","{1299,1299,1299}","{0,0,0}"
4,Jacquenetta Tease,jtease1n@biblegateway.com,4344482346|4344485585,1/2/2019 20:49,"185 Greenwich Street New York, NY 10007",Jimmy Chang,3.9,2.0,"{iMac 21.5-inch A,iMac 27-inch B,iMac 27-inch C}","{1,1,1}","{1099,1999,2299}","{0,0,0}"

Let's query for, the phone number of the customer "Jacquenetta Tease".

In [63]:
# Pass the SQL statement to filter data
stmt = """

    SELECT phone_number 
    FROM phones p
    JOIN cust_phones cp ON cp.phone_id = p.phone_id
    JOIN customers c ON c.customer_id = cp.customer_id
    WHERE c.customer_name = 'Jacquenetta Tease';

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

  phone_number
0   4344482346
1   4344485585

Let's take a look at the product that has been sold more than once

In [65]:
# Pass the SQL statement to filter data
stmt = """

    SELECT p.product_name, COUNT(p.product_name) AS product_count
    FROM products p
    JOIN sold_items s ON s.product_id = p.product_id
    GROUP BY p.product_id
    HAVING COUNT(p.product_name) > 1
    ORDER BY product_count DESC;

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

             product_name  product_count
0   MacBook Pro 13-inch B              8
1   MacBook Pro 13-inch A              7
2   MacBook Pro 15-inch D              6
3       MacBook 12-inch A              6
4               Mac Pro B              6
5   MacBook Pro 15-inch B              6
6        iMac 21.5-inch C              5
7        iMac 21.5-inch A              5
8          iMac 27-inch C              5
9                iMac Pro              5
10      MacBook 12-inch B              4
11         iMac 27-inch B              4
12             Mac mini A              4
13             Mac mini B              3
14  MacBook Air 13-inch B              3
15  MacBook Pro 13-inch C              3
16  MacBook Pro 15-inch A              3
17  MacBook Air 13-inch A              3
18              Mac Pro A              2
19       iMac 21.5-inch B              2

Since "MacBook Pro 13-inch A" was sold more than once, let's look at when it was purchased and by whom:

In [83]:
# Pass the SQL statement to filter data
stmt = """

    SELECT c.customer_name, product_name, product_price, s.purchase_date_time
    FROM customers c
    JOIN sales s ON s.customer_id = c.customer_id
    JOIN sold_items si ON si.sales_id = s.sales_id
    JOIN products p ON p.product_id = si.product_id
    WHERE product_name = 'MacBook Pro 13-inch A';

"""

# Execute the statement and get the results
results = connection.execute(stmt).fetchall()

# Extract column names
column_names = results[0].keys()

# Store results in a new dataframe
temp_df = pd.DataFrame(results, columns=column_names)

# Show results
temp_df

,customer_name,product_name,product_price,purchase_date_time
0,Levy Vickress,MacBook Pro 13-inch A,1299,2019-01-02 17:09:00
1,Ertha Lowthorpe,MacBook Pro 13-inch A,1299,2019-01-02 18:44:00
2,Mano Piaggia,MacBook Pro 13-inch A,1299,2019-01-03 08:20:00
3,Nari Pisco,MacBook Pro 13-inch A,1299,2019-01-03 21:38:00
4,Eli Fuentes,MacBook Pro 13-inch A,1299,2019-01-06 07:09:00
5,Odele Flageul,MacBook Pro 13-inch A,1299,2019-01-07 00:06:00
6,Claudelle Tichelaar,MacBook Pro 13-inch A,1299,2019-01-09 17:12:00

In [99]:
df_test[df_test.purchased_items.str.contains('MacBook Pro 13-inch A')]

,customer_name,email_address,phone_numbers,purchase_date_time,store_location,sales_person,avg_sales_person_rating,sales_person_rating,purchased_items,purchased_quantities,product_prices,discounts
2,Levy Vickress,lvickress1b@yolasite.com,2746684098|2746682450,1/2/2019 17:09,"767 Fifth Avenue New York, NY 10153",Day Yi,5.0,5.0,"{MacBook Pro 13-inch A,MacBook Pro 15-inch D}","{1,1}","{1299,1999}","{0,0}"
3,Ertha Lowthorpe,elowthorpe1o@google.ru,3227613718|3227618832,1/2/2019 18:44,"767 Fifth Avenue New York, NY 10153",Liz Goldsmith,3.6,NaN,"{MacBook 12-inch A,MacBook Pro 13-inch A,iMac ...","{1,1,1}","{1299,1299,1299}","{0,0,0}"
7,Mano Piaggia,mpiaggia1y@netlog.com,5754695406,1/3/2019 8:20,"185 Greenwich Street New York, NY 10007",JJ Chase,4.8,5.0,"{MacBook Pro 13-inch A,iMac 27-inch C}","{1,2}","{1299,2299}","{0.08,0}"
12,Nari Pisco,npisco29@123-reg.co.uk,6273105153|6273105070,1/3/2019 21:38,"767 Fifth Avenue New York, NY 10153",Liz Goldsmith,3.6,3.0,{MacBook Pro 13-inch A},{2},{1299},{0.1}
30,Eli Fuentes,efuentes2e@creativecommons.org,8471783905|8471788265,1/6/2019 7:09,"103 Prince Street New York, NY 10012",Will Grier,4.7,5.0,{MacBook Pro 13-inch A},{1},{1299},{0}
36,Odele Flageul,oflageul2f@ifeng.com,5127847155,1/7/2019 0:06,"767 Fifth Avenue New York, NY 10153",Liz Goldsmith,3.6,3.0,"{MacBook Pro 13-inch A,Mac mini A}","{2,1}","{1299,799}","{0,0}"
49,Claudelle Tichelaar,ctichelaar1r@nifty.com,3879800199|3879809827,1/9/2019 17:12,"103 Prince Street New York, NY 10012",Will Grier,4.7,4.0,"{MacBook Pro 13-inch A,iMac 21.5-inch C,iMac 2...","{1,1,2}","{1299,1499,2299}","{0.35,0,0}"

After checking, we can see that the result matches the original dataset for the same product!